index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-01-28 Fri 19:00 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>PL Reading Group @ IU</title>
<meta name="generator" content="Org mode" />
<link rel="preconnect" href="https://fonts.googleapis.com">
<link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
<link href="https://fonts.googleapis.com/css2?family=Fira+Mono&family=Libre+Baskerville&display=swap" rel="stylesheet">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<nav>
<b>#</b>
<a href="./index.html">        <u>Home         </u></a> |
<a href="./participation.html"><u>Participating</u></a> |
<a href="./contact.html">      <u>Contact      </u></a> |
<a href="./archive.html">      <u>Past Events  </u></a>
</nav>
</head>
<body>
<div id="content">
<h1 class="title">PL Reading Group @ IU
<br />
<span class="subtitle">Spring 2022 🌷</span>
</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd406e7e">About</a></li>
<li><a href="#org0de06c5">Time</a></li>
<li><a href="#orgccedd31">Location</a></li>
<li><a href="#org5baa5cf">Schedule</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgd406e7e" class="outline-2">
<h2 id="orgd406e7e">About</h2>
<div class="outline-text-2" id="text-orgd406e7e">
<p>
<font color="#a90533"> The PL Reading Group </font> (PLRG)
is the de facto successor to PL Wonks and several previous reading groups.
Unlike PL Wonks talk series, the focus of PLRG is paper reading and discussion.
However, we do occasionally schedule presentations, practice talks, and tutorial
sessions (<a href="#org5baa5cf">Schedule</a>).
</p>

<p>
<b>We are looking for presentations!</b> Please visit the "participating" page for
details about voting for papers to read and scheduling your presentation.
</p>
</div>
</div>

<div id="outline-container-org0de06c5" class="outline-2">
<h2 id="org0de06c5">Time</h2>
<div class="outline-text-2" id="text-org0de06c5">
<ul class="org-ul">
<li><b>Time:</b> &lt;4:00 PM&gt; on <b>Tuesdays</b>.</li>
<li>The event usually lasts <b>1 hour</b>. You may leave early.</li>
<li>If you are a speaker, please make sure your presentation is within 40 minutes.</li>
</ul>
</div>
</div>

<div id="outline-container-orgccedd31" class="outline-2">
<h2 id="orgccedd31">Location</h2>
<div class="outline-text-2" id="text-orgccedd31">
<ul class="org-ul">
<li><b>Room:</b> <b>BLIF-4105</b> (study room, 4th floor <i>Luddy Hall</i>)</li>
<li>Where is it? Search "Luddy Hall" on <a href="https://map.iu.edu/iub/">Campus Map</a>.</li>
</ul>
</div>
</div>

<div id="outline-container-org5baa5cf" class="outline-2">
<h2 id="org5baa5cf">Schedule</h2>
<div class="outline-text-2" id="text-org5baa5cf">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><b>Date</b></th>
<th scope="col" class="org-left"><b>Paper Title / Presentation</b></th>
<th scope="col" class="org-left"><b>Speaker(s)</b></th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><del><span class="timestamp-wrapper"><span class="timestamp">&lt;2022-01-18 Tue&gt;</span></span></del></td>
<td class="org-left">POPL Week</td>
<td class="org-left">n/a</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2022-01-25 Tue&gt;</span></span></td>
<td class="org-left"><b>Paper Reading:</b></td>
<td class="org-left">Group Discussion</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><i>A Correspondence between Continuation Passing Style</i></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><i>and Static Single Assignment Form</i></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><b>Links:</b> <a href="https://www.cs.purdue.edu/homes/suresh/502-Fall2008/papers/kelsey-ssa-cps.pdf">1</a> , <a href="https://dl.acm.org/doi/10.1145/202530.202532">ACM-DL</a> , <a href="./upload/correspondence-cps-ssa/scheme-to-ann-cps.rkt">Scheme-&gt;CPS Code</a></td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2022-02-01 Tue&gt;</span></span></td>
<td class="org-left"><b>Presentation:</b> <i>Recursive Types</i></td>
<td class="org-left"><a href="http://www.fyrbll.me/">Kartik</a></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2022-02-08 Tue&gt;</span></span></td>
<td class="org-left">TBA</td>
<td class="org-left">TBA</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2022-02-15 Tue&gt;</span></span></td>
<td class="org-left">TBA</td>
<td class="org-left">TBA</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2022-02-22 Tue&gt;</span></span></td>
<td class="org-left">TBA</td>
<td class="org-left">TBA</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2022-01-28 Fri 19:00</p>
<p class="validation"></p>
</div>
</body>
</html>
